<template lang="pug">
	Teleport(to="body")
		Popup(class="popup-politic" :is-open="isOpen" @close-popup="closePopup")
			.popup__content-wrap
				.popup-header 
					.popup__title Политика конфиденциальности
					.popup__description.content
						ol
							li 
								| Общие положения
								ol 
									li Политика в отношении обработки персональных данных (далее — Политика) направлена на защиту прав и свобод физических лиц, персональные данные обрабатывает Общество с ограниченной ответственностью «ТрансМагистраль» (далее — Оператор), ИНН 5246029760, КПП 524601001
									li Политика разработана в соответствии с п. 2 ч. 1 ст. 18.1 Федерального закона от 27 июля 2006 г. № 152-ФЗ «О персональных данных» (далее — ФЗ «О персональных данных»).
									li Политика содержит сведения, подлежащие раскрытию в соответствии с ч. 1 ст. 14 ФЗ «О персональных данных», и является общедоступным документом.
									li Настоящая Политика подлежит изменению и/или дополнению при изменении законодательства Российской Федерации, внутренних нормативных актов Оператора, а также в соответствии с принятым решением руководящими органами Оператора.
							li 
								p Сведения об операторе
								ol
									li Оператор ведет свою деятельность по адресу г. Н. Новгород, ул. Кузбасская, 1
							li 
								| Сведения об обработке персональных данных
								ol
									li Оператор обрабатывает персональные данные на законной и справедливой основе для выполнения возложенных законодательством функций, полномочий и обязанностей, осуществления прав и законных интересов Оператора, работников Оператора и третьих лиц.
									li Оператор получает персональные данные непосредственно у субъектов персональных данных.
									li Оператор обрабатывает персональные данные автоматизированным и неавтоматизированным способами, с использованием средств вычислительной техники и без использования таких средств.
									li Действия по обработке персональных данных включают сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (предоставление, доступ), обезличивание, блокирование, удаление и уничтожение.
									li 
										| Оператор осуществляет анализ предпочтений пользователя и мониторинг потребительского поведения с использованием сторонних сервисов аналитики, размещенных на сайтах:
										ul
											li Яндекс.Метрика https://metrika.yandex.ru;
											li Google Analytics https://analytics.google.com
							li 
								| Обработка персональных данных клиентов
								ol 
									li Оператор обрабатывает персональные данные клиентов в рамках правоотношений с Оператором, урегулированных частью второй Гражданского Кодекса Российской Федерации от 26 января 1996 г. № 14-ФЗ, (далее — клиентов).
									li 
										| Оператор обрабатывает персональные данные клиентов в целях соблюдения норм законодательства РФ, а также с целью:
										ul
											li идентификации пользователя настоящего интернет-сайта;
											li предоставления пользователям сайта и клиентам ООО «ТрансМагистраль» эффективной клиентской поддержки
											li информирования о акциях, предложениях и услугах Оператора и третьих лиц по усмотрению Оператора, в том числе путем осуществления прямых контактов с субъектом персональных данных с помощью средств связи;
											li заключение и исполнение условий договора;
											li организации и проведения Оператором мероприятий и опросов, маркетинговых, статистических и прочих исследований;
											li анализа качества предоставляемых  услуг и улучшения качества обслуживания клиентов;
											li анализ предпочтений и мониторинг потребительского поведения Пользователя настоящего интернет-сайта;
									li Оператор обрабатывает персональные данные клиентов с их согласия, предоставляемого клиентами и/или их законными представителями путем совершения конклюдентных действий на настоящем интернет-сайте, в том числе, но не ограничиваясь, отправкой формы обратной связи, в соответствии с настоящей Политикой.
									li Оператор обрабатывает персональные данные клиентов не дольше, чем того требуют цели обработки персональных данных, если иное не предусмотрено требованиями законодательства РФ.
									li 
										| Оператор обрабатывает следующие персональные данные клиентов:
										ul 
											li фамилия, имя, отчество;
											li город, ближайший к месту жительства Пользователя;
											li номер контактного телефона;
											li адрес электронной почты;
											li данные, которые передаются в автоматическом режиме, в зависимости от настроек, программным обеспечением Пользователя, включая, но не ограничиваясь IP-Информация из cookies, MAC-адрес, внешний источник перехода на сайт, информация об используемом Пользователем программном обеспечении и оборудовании для работы в сети Интернет, каналах связи, передаваемой и получаемой с использованием сайта transmagistral.ru информации и материалов.
							li 
								| Сведения об обеспечении безопасности персональных данных
								ol
									li Оператор назначает ответственного за организацию обработки персональных данных для выполнения обязанностей, предусмотренных ФЗ «О персональных данных» и принятыми в соответствии с ним нормативными правовыми актами.
									li 
										| Оператор применяет комплекс правовых, организационных и технических мер по обеспечению безопасности персональных данных для обеспечения конфиденциальности персональных данных и их защиты от неправомерных действий:
										ul
											li обеспечивает неограниченный доступ к Политике, копия которой размещена по адресу нахождения Оператора, а также может быть размещена на сайте Оператора (при его наличии);
											li во исполнение Политики утверждает и приводит в действие документ «Положение об обработке персональных данных» (далее — Положение) и иные локальные акты;
											li производит ознакомление работников с положениями законодательства о персональных данных, а также с Политикой и Положением;
											li осуществляет допуск работников к персональным данным, обрабатываемым в информационной системе Оператора, а также к их материальным носителям только для выполнения трудовых обязанностей;
											li устанавливает правила доступа к персональным данным, обрабатываемым в информационной системе Оператора, а также обеспечивает регистрацию и учёт всех действий с ними;
											li производит оценку вреда, который может быть причинен субъектам персональных данных в случае нарушения ФЗ «О персональных данных»;
											li производит определение угроз безопасности персональных данных при их обработке в информационной системе Оператора;
											li применяет организационные и технические меры и использует средства защиты информации, необходимые для достижения установленного уровня защищенности персональных данных;
											li осуществляет обнаружение фактов несанкционированного доступа к персональным данным и принимает меры по реагированию, включая восстановление персональных данных, модифицированных или уничтоженных вследствие несанкционированного доступа к ним;
											li производит оценку эффективности принимаемых мер по обеспечению безопасности персональных данных до ввода в эксплуатацию информационной системы Оператора;
											li осуществляет внутренний контроль соответствия обработки персональных данных ФЗ «О персональных данных», принятым в соответствии с ним нормативным правовым актам, требованиям к защите персональных данных, Политике, Положению и иным локальным актам, включающий контроль за принимаемыми мерами по обеспечению безопасности персональных данных и их уровня защищенности при обработке в информационной системе Оператора.
							li 
								| Права субъектов персональных данных
								ol
									li 
										| Субъект персональных данных имеет право:
										ul
											li на получение персональных данных, относящихся к данному субъекту, и информации, касающейся их обработки;
											li на уточнение, блокирование или уничтожение его персональных данных в случае, если они являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки;
											li на отзыв данного им согласия на обработку персональных данных;
											li на защиту своих прав и законных интересов, в том числе на возмещение убытков и компенсацию морального вреда в судебном порядке;
											li на обжалование действий или бездействия Оператора в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке.
									li Для реализации своих прав и законных интересов субъекты персональных данных имеют право обратиться к Оператору либо направить запрос лично или с помощью представителя. Запрос должен содержать сведения, указанные в ч. 3 ст. 14 ФЗ «О персональных данных».
</template>

<script setup>
defineProps({
   isOpen: {
      type: Boolean,
   },
});
const emit = defineEmits(["closePopup"]);

// eslint-disable-next-line
const closePopup = () => {
   emit("closePopup");
};
</script>
